<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="conv2d_8_input" type="Parameter" version="opset1">
			<data shape="?,60,290,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8_input"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,conv2d_8_input:0">
					<dim>-1</dim>
					<dim>60</dim>
					<dim>290</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_8_input/Transpose([0 3 1 2])/value12722006" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8_input/Transpose([0 3 1 2])/value12722006"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_8_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8_input/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>60</dim>
					<dim>290</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential/conv2d_8/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="32" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_8/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_8/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_8/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_8/Conv2D:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3488" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_8/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential/activation_11/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_11/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_11/Relu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential/conv2d_9/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="3616" size="36864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_9/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_9/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_9/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>290</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_9/Conv2D:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="40480" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_9/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential/activation_12/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_12/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_12/Relu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential/max_pooling2d_5/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_5/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>288</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/max_pooling2d_5/MaxPool:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential/conv2d_10/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="40608" size="73728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_10/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_10/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_10/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_10/Conv2D:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="114336" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_10/BiasAdd:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential/activation_13/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_13/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_13/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential/conv2d_11/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="114592" size="147456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_11/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_11/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_11/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_11/Conv2D:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="262048" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_11/BiasAdd:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential/activation_14/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_14/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_14/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential/max_pooling2d_6/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_6/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>142</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/max_pooling2d_6/MaxPool:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential/conv2d_12/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="262304" size="294912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_12/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_12/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential/conv2d_12/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_12/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_12/Conv2D:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="557216" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_12/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential/activation_15/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_15/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_15/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential/conv2d_13/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="557728" size="589824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_13/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_13/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential/conv2d_13/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_13/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>71</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_13/Conv2D:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1147552" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_13/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential/activation_16/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_16/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_16/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential/max_pooling2d_7/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_7/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/max_pooling2d_7/MaxPool:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/sequential/conv2d_14/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1148064" size="1179648"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_14/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_14/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential/conv2d_14/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_14/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_14/Conv2D:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2327712" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/conv2d_14/BiasAdd:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential/activation_17/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_17/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_17/Relu:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>17</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool/Transpose/value12202024" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2328736" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool/Transpose/value12202024"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool/Transpose"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/max_pooling2d_8/MaxPool:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>17</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/sequential/flatten_2/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2328768" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/flatten_2/Const"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/sequential/flatten_2/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/sequential/flatten_2/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/flatten_2/Reshape"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>17</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/flatten_2/Reshape:0">
					<dim>-1</dim>
					<dim>8704</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="2048, 8704" offset="2328784" size="71303168"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp:0">
					<dim>2048</dim>
					<dim>8704</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/sequential/dense_4/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_4/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8704</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>8704</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_4/MatMul:0">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2048" offset="73631952" size="8192"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/sequential/dense_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_4/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_4/BiasAdd:0">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/sequential/activation_18/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_18/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_18/Relu:0,StatefulPartitionedCall/sequential/dropout_3/Identity:0">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 2048" offset="73640144" size="8388608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp:0">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/sequential/dense_5/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_5/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_5/MatMul:0">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1024" offset="82028752" size="4096"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/sequential/dense_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_5/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_5/BiasAdd:0">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/sequential/activation_19/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_19/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_19/Relu:0,StatefulPartitionedCall/sequential/dropout_4/Identity:0">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="712, 1024" offset="82032848" size="2916352"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp:0">
					<dim>712</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/sequential/dense_6/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_6/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>712</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_6/MatMul:0">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 712" offset="84949200" size="2848"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>712</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/sequential/dense_6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_6/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>712</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_6/BiasAdd:0">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/sequential/activation_20/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_20/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/activation_20/Relu:0,StatefulPartitionedCall/sequential/dropout_5/Identity:0">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="4, 712" offset="84952048" size="11392"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp:0">
					<dim>4</dim>
					<dim>712</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/sequential/dense_7/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_7/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>712</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>712</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_7/MatMul:0">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4" offset="84963440" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/sequential/dense_7/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense_7/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_7/BiasAdd:0">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/sequential/activation_21/Sigmoid" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/activation_21/Sigmoid"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Func/StatefulPartitionedCall/output/_23:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential/activation_21/Sigmoid:0">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Func/StatefulPartitionedCall/output/_23:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Func/StatefulPartitionedCall/output/_23:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="0" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="43" to-port="0"/>
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="44" from-port="0" to-layer="45" to-port="1"/>
		<edge from-layer="45" from-port="2" to-layer="47" to-port="0"/>
		<edge from-layer="46" from-port="0" to-layer="47" to-port="1"/>
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="52" to-port="0"/>
		<edge from-layer="51" from-port="0" to-layer="52" to-port="1"/>
		<edge from-layer="52" from-port="2" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="0" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="57" to-port="0"/>
		<edge from-layer="56" from-port="0" to-layer="57" to-port="1"/>
		<edge from-layer="57" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="0" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="62" to-port="0"/>
		<edge from-layer="61" from-port="0" to-layer="62" to-port="1"/>
		<edge from-layer="62" from-port="2" to-layer="64" to-port="0"/>
		<edge from-layer="63" from-port="0" to-layer="64" to-port="1"/>
		<edge from-layer="64" from-port="2" to-layer="65" to-port="0"/>
		<edge from-layer="65" from-port="1" to-layer="66" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.2.0-7713-af16ea1d79a-releases/2022/2"/>
		<Runtime_version value="2022.2.0-7713-af16ea1d79a-releases/2022/2"/>
		<legacy_path value="True"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<input_model_is_text value="False"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
