<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="mobilenetv3small_input" type="Parameter" version="opset1">
			<data shape="?,90,90,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="mobilenetv3small_input"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,mobilenetv3small_input:0">
					<dim>-1</dim>
					<dim>90</dim>
					<dim>90</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="mobilenetv3small_input/Transpose([0 3 1 2])/value1160815490" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="mobilenetv3small_input/Transpose([0 3 1 2])/value1160815490"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="mobilenetv3small_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="mobilenetv3small_input/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>90</dim>
					<dim>90</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast/x" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="32" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast/x"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast/x:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/mul:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast_1/x" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="36" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast_1/x"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/Cast_1/x:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/rescaling_4/add:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="40" size="1728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_8976" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1768" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_8976"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/Conv/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_72/mul" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_72/mul, StatefulPartitionedCall/sequential_4/MobilenetV3small/tf.math.multiply_108/Mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_72/mul:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1832" size="576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/depthwise/ReadVariableOp:0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/depthwise, StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/pad/Pad"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_89798984" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2408" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89798984"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_129/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_129/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_129/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="1162315367" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2472" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1162315367"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/AvgPool/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/AvgPool/Mean"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/AvgPool/Mean:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="2488" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/Conv2D:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="3000" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv/BiasAdd:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Relu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Relu/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Relu/Relu:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 1" offset="3032" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/Conv2D:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="3544" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Conv_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/tf.math.multiply_109/Mul" type="HSigmoid" version="opset5">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/tf.math.multiply_109/Mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/tf.math.multiply_109/Mul:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Mul/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Mul/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/squeeze_excite/Mul/mul:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="3608" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_89878992" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="4632" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89878992"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv/project/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 16, 1, 1" offset="4696" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/Conv2D/ReadVariableOp:0">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_89959000" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="9304" size="288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89959000"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_131/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_131/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_131/Relu:0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 1, 3, 3" offset="9592" size="2592"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/depthwise/ReadVariableOp:0">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/depthwise, StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/pad/Pad"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>23</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_90039008" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="12184" size="288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90039008"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_132/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_132/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_132/Relu:0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 72, 1, 1" offset="12472" size="6912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_90119016" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="19384" size="96"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90119016"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_1/project/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="88, 24, 1, 1" offset="19480" size="8448"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/Conv2D/ReadVariableOp:0">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_90199024" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="27928" size="352"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90199024"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_133/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_133/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_133/Relu:0">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="88, 1, 1, 3, 3" offset="28280" size="3168"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/depthwise/ReadVariableOp:0">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_90279032" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="31448" size="352"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90279032"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_134/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_134/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/re_lu_134/Relu:0">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 88, 1, 1" offset="31800" size="8448"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_90359040" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="40248" size="96"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90359040"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/project/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/Add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/Add/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_2/Add/add:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 24, 1, 1" offset="40344" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_90439048" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="49560" size="384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90439048"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_73/mul" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_73/mul, StatefulPartitionedCall/sequential_4/MobilenetV3small/tf.math.multiply_110/Mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/MobilenetV3small/multiply_73/mul:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/sequential_4/MobilenetV3small/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 5, 5" offset="49944" size="9600"/>
			<rt_info>
